let text = "تطوير الويب هو مجال واسع ومتجدد يعتمد على مجموعة كبيرة من التقنيات واللغات البرمجية، ويحتاج المبرمج فيه إلى التعلم المستمر والتدريب اليومي حتى يتمكن من تطوير مهاراته وتحسين طريقة كتابة الشفرات البرمجية وبناء مواقع وتطبيقات حديثة وسريعة وسهلة الاستخدام، بالإضافة إلى الاهتمام بتجربة المستخدم والأداء والأمان.";

if (text.length >= 200) {

    let first = text.slice(0, 20)

    let last = text.slice(-20)

    let middle = text.length - 40

    let dots = ".".repeat(middle)

    alert(first + dots + last)
}